{
  "name": "Surya Suhaas",
  "title": "Software Engineer • IoT Developer • Researcher",
  "tagline": "Building thoughtful systems where code meets clarity",
  "bio": "I'm a software engineer and researcher driven by curiosity, systems thinking, and a desire to build meaningful technology. My work blends deep technical skills with a human-centered perspective.",
  "longBio": "I work at the intersection of software, hardware, and research—developing systems that are not just functional, but thoughtfully designed. My background spans embedded systems, web platforms, and AI-based interfaces, with a strong focus on IoT and human-centered technology.\n\nWhether I’m building decentralized infrastructure or designing intuitive interfaces, I value clarity, purpose, and context. I believe the best solutions come from understanding a problem deeply and solving it with intention.\n\nI’m also fascinated by the ethical and societal impact of the systems we build. This perspective pushes me to ask not only *what* we can create—but *why* and *for whom* we create it.",
  "location": "Hyderabad, Telangana",
  "email": "hello@suryasuhaas.in",
  "phone": "+1 (555) 123-4567",
  "availability": "Open to impactful projects, research collaborations, and deep tech ventures",
  "socialLinks": {
    "github": "https://github.com/mssuhaas",
    "twitter": "https://twitter.com/surya_suhaas",
    "linkedin": "https://linkedin.com/in/surya_suhaas"
  },
  "skills": {
    "technical": [
      "JavaScript / TypeScript",
      "React / Next.js",
      "Node.js",
      "Python",
      "Embedded Systems",
      "IoT Prototyping",
      "Data Visualization",
      "Machine Learning",
      "Solana / Web3"
    ],
    "conceptual": [
      "Systems Thinking",
      "Problem Analysis",
      "Design Thinking",
      "Human-Centered Design",
      "Responsible Tech Development",
      "Research Methodology"
    ]
  },
  "quotes": [
    "Good design is as little design as possible.",
    "Technology should solve real problems, not create new ones.",
    "The best solutions emerge from deep understanding, not quick fixes.",
    "Clarity of thought leads to clarity of code."
  ]
}
